import React from 'react'

export default function page() {
  return (
    <div>

      <div className="max-w-4xl mx-auto py-10 px-4">
        <h1 className="text-3xl font-bold text-center mb-8">الشروط والأحكام</h1>
        <div className="space-y-6 text-right">
          <p className="text-lg">
            النتائج مضمونه، وفي حال عدم حصولك على نتيجة مع التزام كامل من قبلك لمدة ٣ شهور، يمكنك استرجاع مبلغ الاشتراك
          </p>

          <p className="text-lg">
            بعد استلام البرنامج، لدى المشترك 7 ايام قبل بدء مدة الإشتراك
          </p>

          <p className="text-lg">
            يجب على المشترك الالتزام بمواعيد المتابعة والتواصل مع المدرب وإرسال نتائجه وقياساته وملاحظاته في الوقت الذي يحدده المدرب، والمتابعة إلزامية على المشترك، أي أن التواصل سيكون من جانبه في وقت المتابعة فالمتابعة مسؤولية المشترك
          </p>

          <p className="text-lg">
            قد يطلب المدرب بعض المكملات الغذائية لسد نقص في التغذية أو لتسهيل الالتزام بالبرنامج الغذائي أو لأي سبب يراه المدرب راجحاً، ويجب على المشترك توفير جميع المكملات الغذائية والالتزام بها وفقاً لطريقة الاستخدام المطلوبة منه
          </p>

          <p className="text-lg">
            ذا كان لا يوجد تحليل دم حديث (أقل من 6 شهور) سيتم طلب عمل التحاليل للتأكد من سلامتك وعدم وجود أي نواقص، حيث أن بعض النواقص قد تؤثر على الصحة والنتائج
          </p>

          <p className="text-lg">
            لا نستقبل الحوامل والمرضعات وحالات اضطرابات الطعام حيث أن هذه الحالات تتطلب متابعة خاصة من قِبل أخصائيين مختصين في هذا المجال، وفي الوقت الحالي هذا خارج عن اختصاصنا
          </p>

          <p className="text-lg">
            سيطلب من جميع المشتركين رجال ونساء إرسال فيديوهات التمارين للتأكد من طريقة أداء التمرين الصحيحة، ذلك لتجنب الإصابات وضمان الحصول على النتائج، يجب على المشترك مشاركة هذه الفيديوهات لضمان سلامته وسلامة النتائج فهي أمر إلزامي، علماً بأنه سيشاركها مع مدربه فقط ولن يشاهدها أحد غيره، لن يتم نشر الفيديوهات إلا بعد أخذ إذن المشترك
          </p>

          <p className="text-lg">
            لا نقدم جداول تمرين خاصة بالكروسفت او لرياضة البارولفتنق او أي رياضة أخرى، وجداول التمرين التي نقدمها تهدف بالمرتبة الاولى الى البناء العضلي وشد الجسم وهذه تعتبر لعبة المقاومة العادية
          </p>

          <p className="text-lg">
            يتم تسليم الجدول خلال 3-7 أيام عمل من استلام المدرب جميع التفاصيل
          </p>

          <p className="text-lg">
            يتم الرد على جميع المشتركين في خلال 24 ساعة من وقت إرسال آخر رسالة
          </p>
        </div>
      </div>
    </div>
  )
}