export interface Question {
  id: number;
  question: string;
  options?: string[];
  answer?: string;
  value?: string;
}

export interface Subscription {
  id: number;
  name: string;
  description: string;
  price: number;
  type?: 'عادي' | 'طالب';
  image: string;
}

export const questions: { male: Question[], female: Question[] } = {
  male: [
    // Multiple Choice Questions
    {
      id: 1,
      question: "ما هو أفضل وقت لممارسة التمارين الرياضية؟ ذكر",
      
      options: ["الصباح الباكر", "بعد الظهر", "المساء", "الليل"],
      answer: "الصباح الباكر"
    },
    {
      id: 2,
      question: "كم عدد مجموعات التمارين الموصى بها للمبتدئين؟ ذكر",
      options: ["2-3 مجموعات", "4-5 مجموعات", "6-8 مجموعات", "10 مجموعات"],
      answer: "2-3 مجموعات"
    },
    {
      id: 3,
      question: "ما هو أفضل تمرين لتقوية عضلات البطن؟",
      options: ["تمرين البلانك", "تمرين الضغط", "تمرين القرفصاء", "تمرين الجري"],
      answer: "تمرين البلانك"
    },
    {
      id: 4,
      question: "كم دقيقة يجب أن يستمر التمرين الهوائي؟",
      options: ["10 دقائق", "20 دقيقة", "30 دقيقة", "60 دقيقة"],
      answer: "30 دقيقة"
    },
    {
      id: 5,
      question: "ما هو أفضل غذاء قبل التمرين؟",
      options: ["الموز", "البروتين", "الكربوهيدرات", "الدهون"],
      answer: "الكربوهيدرات"
    },
    {
      id: 6,
      question: "كم مرة في الأسبوع يجب ممارسة تمارين القوة؟",
      options: ["مرة واحدة", "مرتين", "3-4 مرات", "5-6 مرات"],
      answer: "3-4 مرات"
    },
    {
      id: 7,
      question: "ما هو أفضل تمرين لحرق الدهون؟",
      options: ["تمرين الضغط", "تمرين القفز", "تمرين الجري", "تمرين اليوغا"],
      answer: "تمرين الجري"
    },
    {
      id: 8,
      question: "كم ساعة يجب الانتظار بين التمارين؟",
      options: ["12 ساعة", "24 ساعة", "36 ساعة", "48 ساعة"],
      answer: "24 ساعة"
    },
    {
      id: 9,
      question: "ما هو أفضل نوع من التمارين لتحسين المرونة؟",
      options: ["تمارين القوة", "تمارين التمدد", "تمارين القلب", "تمارين التوازن"],
      answer: "تمارين التمدد"
    },
    {
      id: 10,
      question: "كم لتر من الماء يجب شربه أثناء التمرين؟",
      options: ["0.5 لتر", "1 لتر", "2 لتر", "3 لتر"],
      answer: "1 لتر"
    },
    // Value Questions
    {
      id: 11,
      question: "عدد التكرارات المثالي لتمرين الضغط للمبتدئين",
      value: "10-15 تكرار"
    },
    {
      id: 12,
      question: "مدة تمرين البلانك المثالية",
      value: "45-60 ثانية"
    },
    {
      id: 13,
      question: "معدل ضربات القلب المستهدف أثناء التمرين",
      value: "60-80% من الحد الأقصى"
    },
    {
      id: 14,
      question: "مدة الراحة بين المجموعات",
      value: "60-90 ثانية"
    },
    {
      id: 15,
      question: "عدد السعرات الحرارية المحروقة في ساعة من الجري",
      value: "600-800 سعرة"
    }
  ],
  female: [
    // Multiple Choice Questions
    {
      id: 1,
      question: "ما هو أفضل وقت لممارسة التمارين الرياضية؟ أنثى",
      options: ["الصباح الباكر", "بعد الظهر", "المساء", "الليل"],
      answer: "الصباح الباكر"
    },
    {
      id: 2,
      question: "كم عدد مجموعات التمارين الموصى بها للمبتدئين؟",
      options: ["2-3 مجموعات", "4-5 مجموعات", "6-8 مجموعات", "10 مجموعات"],
      answer: "2-3 مجموعات"
    },
    {
      id: 3,
      question: "ما هو أفضل تمرين لتقوية عضلات البطن؟",
      options: ["تمرين البلانك", "تمرين الضغط", "تمرين القرفصاء", "تمرين الجري"],
      answer: "تمرين البلانك"
    },
    {
      id: 4,
      question: "كم دقيقة يجب أن يستمر التمرين الهوائي؟",
      options: ["10 دقائق", "20 دقيقة", "30 دقيقة", "60 دقيقة"],
      answer: "30 دقيقة"
    },
    {
      id: 5,
      question: "ما هو أفضل غذاء قبل التمرين؟",
      options: ["الموز", "البروتين", "الكربوهيدرات", "الدهون"],
      answer: "الكربوهيدرات"
    },
    {
      id: 6,
      question: "كم مرة في الأسبوع يجب ممارسة تمارين القوة؟",
      options: ["مرة واحدة", "مرتين", "3-4 مرات", "5-6 مرات"],
      answer: "3-4 مرات"
    },
    {
      id: 7,
      question: "ما هو أفضل تمرين لحرق الدهون؟",
      options: ["تمرين الضغط", "تمرين القفز", "تمرين الجري", "تمرين اليوغا"],
      answer: "تمرين الجري"
    },
    {
      id: 8,
      question: "كم ساعة يجب الانتظار بين التمارين؟",
      options: ["12 ساعة", "24 ساعة", "36 ساعة", "48 ساعة"],
      answer: "24 ساعة"
    },
    {
      id: 9,
      question: "ما هو أفضل نوع من التمارين لتحسين المرونة؟",
      options: ["تمارين القوة", "تمارين التمدد", "تمارين القلب", "تمارين التوازن"],
      answer: "تمارين التمدد"
    },
    {
      id: 10,
      question: "كم لتر من الماء يجب شربه أثناء التمرين؟",
      options: ["0.5 لتر", "1 لتر", "2 لتر", "3 لتر"],
      answer: "1 لتر"
    },
    // Value Questions
    {
      id: 11,
      question: "عدد التكرارات المثالي لتمرين الضغط للمبتدئين",
      value: "10-15 تكرار"
    },
    {
      id: 12,
      question: "مدة تمرين البلانك المثالية",
      value: "45-60 ثانية"
    },
    {
      id: 13,
      question: "معدل ضربات القلب المستهدف أثناء التمرين",
      value: "60-80% من الحد الأقصى"
    },
    {
      id: 14,
      question: "مدة الراحة بين المجموعات",
      value: "60-90 ثانية"
    },
    {
      id: 15,
      question: "عدد السعرات الحرارية المحروقة في ساعة من الجري",
      value: "600-800 سعرة"
    }
  ]
};

export const subscriptions: Subscription[] = [
  {
    id: 1,
    name: "الاشتراك الذهبي",
    description: "اشتراك ٣ أشهر تغذية وتمرين",
    price: 399,
    image: "/placeholder.png",
    type: "عادي"
  },
  {
    id: 2,
    name: "اشتراك الطلاب",
    description: "اشتراك ٣ أشهر تغذية وتمرين",
    price: 249,
    image: "/placeholder.png",
    type: "طالب"
  },

];


